; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=38, remove_proportion=0.2, bases=7, instance_id=22, output=./training, seed=63

(define (problem warehouse-22)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 box29 box30 box31 box32 box33 box34 box35 box36 box37 box38 - box
        base1 base2 base3 base4 base5 base6 base7 - base
    )
    (:init
        (to-remove box6)
        (to-remove box17)
        (to-remove box19)
        (to-remove box25)
        (to-remove box29)
        (to-remove box31)
        (to-remove box38)
        (clear box25)
        (on box25 box7)
        (on box7 box14)
        (on box14 box2)
        (on box2 box3)
        (on box3 box26)
        (on-base box26 base1)
        (clear box15)
        (on box15 box21)
        (on box21 box5)
        (on box5 box30)
        (on box30 box29)
        (on box29 box19)
        (on-base box19 base2)
        (clear box22)
        (on box22 box6)
        (on box6 box20)
        (on box20 box10)
        (on box10 box37)
        (on-base box37 base3)
        (clear box34)
        (on box34 box38)
        (on box38 box35)
        (on-base box35 base4)
        (clear box32)
        (on box32 box23)
        (on box23 box33)
        (on box33 box27)
        (on box27 box13)
        (on-base box13 base5)
        (clear box4)
        (on box4 box16)
        (on box16 box24)
        (on box24 box28)
        (on box28 box36)
        (on box36 box12)
        (on box12 box9)
        (on box9 box1)
        (on-base box1 base6)
        (clear box8)
        (on box8 box18)
        (on box18 box17)
        (on box17 box31)
        (on box31 box11)
        (on-base box11 base7)
    )
    (:goal (and 
        (removed box6)
        (removed box17)
        (removed box19)
        (removed box25)
        (removed box29)
        (removed box31)
        (removed box38)
    ))
)

; plan
1. (move box15 box21 box32)
   deleted: (clear box32) (on box15 box21)
   added: (on box15 box32) (clear box21)
   goals met: 0 of 7
2. (move box21 box5 box15)
   deleted: (clear box15) (on box21 box5)
   added: (on box21 box15) (clear box5)
   goals met: 0 of 7
3. (move box22 box6 box21)
   deleted: (clear box21) (on box22 box6)
   added: (on box22 box21) (clear box6)
   goals met: 0 of 7
4. (move box34 box38 box22)
   deleted: (clear box22) (on box34 box38)
   added: (on box34 box22) (clear box38)
   goals met: 0 of 7
5. (remove box25 box7)
   deleted: (on box25 box7) (clear box25)
   added: (removed box25) (clear box7)
   goals met: 1 of 7
6. (move box5 box30 box34)
   deleted: (clear box34) (on box5 box30)
   added: (on box5 box34) (clear box30)
   goals met: 1 of 7
7. (remove box38 box35)
   deleted: (on box38 box35) (clear box38)
   added: (removed box38) (clear box35)
   goals met: 2 of 7
8. (move box30 box29 box35)
   deleted: (clear box35) (on box30 box29)
   added: (on box30 box35) (clear box29)
   goals met: 2 of 7
9. (remove box29 box19)
   deleted: (on box29 box19) (clear box29)
   added: (removed box29) (clear box19)
   goals met: 3 of 7
10. (remove-from-base box19 base2)
   deleted: (on-base box19 base2) (clear box19)
   added: (removed box19) (clear-base base2)
   goals met: 4 of 7
11. (move box8 box18 box30)
   deleted: (clear box30) (on box8 box18)
   added: (on box8 box30) (clear box18)
   goals met: 4 of 7
12. (move box18 box17 box4)
   deleted: (clear box4) (on box18 box17)
   added: (on box18 box4) (clear box17)
   goals met: 4 of 7
13. (remove box17 box31)
   deleted: (on box17 box31) (clear box17)
   added: (removed box17) (clear box31)
   goals met: 5 of 7
14. (remove box31 box11)
   deleted: (on box31 box11) (clear box31)
   added: (removed box31) (clear box11)
   goals met: 6 of 7
15. (remove box6 box20)
   deleted: (on box6 box20) (clear box6)
   added: (removed box6) (clear box20)
   goals met: 7 of 7
